* mgmt/base_config PLAN

  # aws_ssm_parameter.common_sensitive["/bfd/mgmt/common/sensitive/alarm_lambda_error_stats_runbook_url"] will be created
  + resource "aws_ssm_parameter" "common_sensitive" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "arn:aws:kms:us-east-1:577373831711:key/mrk-988de2365a354883bf8b253f885e0153"
      + name           = "/bfd/mgmt/common/sensitive/alarm_lambda_error_stats_runbook_url"
      + overwrite      = true
      + tags_all       = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

* mgmt PLAN (targeted due to Quicksight User drift)

  # aws_cloudwatch_metric_alarm.lambda_errors will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda_errors" {
      ~ alarm_description         = <<-EOT
          - Alarm that is defined to send alerts to the BFD-Warnings/Alerts slack channel that notify us of any reported Lambda failures
          + Alarm that is defined to send alerts to the BFD-Warnings/Alerts slack channel on reported Lambda failures
          + See https://github.com/CMSgov/beneficiary-fhir-data/wiki/How-to-Evaluate-statistics-for-generic-%22Lambda-Error%22-Alerts-posted-to-Slack for instructions on investigating this alert.
        EOT
        id                        = "bfd-mgmt-lambda-error"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
